Revit 2027 API
RebarBendingDetailType.AngularDimensionsMeasurementOptions Property
 Identifies the measurement option for angular dimensions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BendingDetailAngularDimensionsMeasurementOptions AngularDimensionsMeasurementOptions { get; set; }
Public Property AngularDimensionsMeasurementOptions As BendingDetailAngularDimensionsMeasurementOptions
	Get
	Set
public:
property BendingDetailAngularDimensionsMeasurementOptions AngularDimensionsMeasurementOptions {
	BendingDetailAngularDimensionsMeasurementOptions get ();
	void set (BendingDetailAngularDimensionsMeasurementOptions value);
}
member AngularDimensionsMeasurementOptions : BendingDetailAngularDimensionsMeasurementOptions with get, set
Property Value
BendingDetailAngularDimensionsMeasurementOptions
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace